[
    {
        "image": "/images/Al-Hadiid.png",
        "company": "Yayasan Al-Hadiid", 
        "role": "Website Administrator",
        "description": [
             "Managed and maintained the school's website, ensuring content was always up-to-date and relevant. Collaborated with various departments to gather and publish the latest information. Implemented new features per the school's needs. Ensured website security from cyber threats."
        ],
        "dates": "November 2023 - Present"
    },
    {
        "image": "/images/pubmedia.png",
        "company": "PT. Renjana Sinergi | Pubmedia", 
        "role": "Landing Page Builder - Internship",
        "description": [
            "Designing and building the website structure to ensure clear navigation and user flow. Creating user interface (UI) designs focusing on usability and aesthetics. Implementing UI designs into a WordPress platform using Elementor, ensuring responsive and functional layouts."
        ],
        "dates": "January - March 2025"
    },
    {
        "image": "/images/kafamilk.png",
        "company": "PT. Renjana Sinergi | Kafamilk", 
        "role": "Landing Page Builder - Internship",
        "description": [
            "Designing and building website structures to ensure clear navigation and intuitive user flow. Creating user interface (UI) designs that emphasize simplicity and informativeness. My focus was on delivering a clean layout that effectively communicated content while maintaining userfriendliness and  visual appeal. Implementing UI designs into Berdu, ensuring responsive and functional layouts that worked seamlessly across various devices"
        ],
        "dates": "January - March 2025"
    },
    {
        "image": "/images/serenaHills.png",
        "company": "PT. Renjana Sinergi | Serena Hills", 
        "role": "Landing Page Builder - Internship",
        "description": [
            "Creating user interface (UI) designs tailored to client needs, focusing on usability, aesthetics, and delivering a visually appealing yet functional experience. Implementing the approved UI designs into a WordPress platform using Elementor, ensuring the final product was responsive, aligned with client expectations, and optimized for various devices"
        ],
        "dates": "January - March 2025"
    }
  ]