[
  {
    "name": "HTML",
    "icon": "/HTML5.svg",
    "description": "I have good HTML skills, which serve as the foundation of web development. I can create well-structured and standards-compliant websites."
  },
  {
    "name": "CSS",
    "icon": "/CSS3.svg",
    "description": "I have good CSS skills, which are essential for styling and laying out websites. I can create visually appealing, responsive, and well-structured designs."
  },
  {
    "name": "JavaScript",
    "icon": "/JavaScript.svg",
    "description": "I have a good understanding of JavaScript, especially in front-end development. I am capable of using JavaScript to create interactive and dynamic websites, enhancing the user experience."
  },
  {
    "name": "Tailwind CSS",
    "icon": "/Tailwind CSS.svg",
    "description": "I have a good understanding of Tailwind CSS, a utility-first framework for fast and efficient web design. I can use it to create responsive and customizable designs with minimal effort."
  },
  {
    "name": "Figma",
    "icon": "/Figma.svg",
    "description": "I have experience using Figma for designing wireframes, prototypes, and user interfaces. This gives me a strong understanding of UI/UX principles."
  },
  {
    "name": "Git & GitHub",
    "icon": "/GitHub.svg",
    "description": "I have experience using Git and GitHub to manage project versions and collaborate with other developers. This ensures code integrity and efficient teamwork."
  },
  {
    "name": "Laravel",
    "icon": "/Laravel.svg",
    "description": "I have basic experience with Laravel, a popular PHP framework, which I've used to build web applications. I can work with routes, controllers, and models to create scalable systems."
  },
  {
    "name": "MySQL",
    "icon": "/MySQL.svg",
    "description": "I have a basic understanding of MySQL, and I've applied it to create projects using phpMyAdmin. I'm familiar with creating and managing databases, and writing queries."
  },
  {
    "name": "Java",
    "icon": "/Java.svg",
    "description": "I have a basic understanding of Java, which I use for back-end development with frameworks like Spring. I've learned core concepts such as object-oriented programming (OOP) and functions."
  },
  {
    "name": "Spring",
    "icon": "/Spring.svg",
    "description": "I have basic experience with the Spring framework, a powerful Java framework. I can use it to build robust and scalable back-end applications."
  },
  {
    "name": "TypeScript",
    "icon": "/TypeScript.svg",
    "description": "I have a basic understanding of TypeScript, a superset of JavaScript that adds static typing to the language. It helps me write more robust and maintainable code."
  },
  {
    "name": "Supabase",
    "icon": "/supabase.svg",
    "description": "I have a basic understanding of Supabase. I can use it as a back-end as a service (BaaS) for projects that need real-time database, authentication, and file storage."
  },
  {
    "name": "Firebase",
    "icon": "/Firebase.svg",
    "description": "I have a basic understanding of Firebase. I can use it as a back-end as a service (BaaS) for projects that need real-time database, authentication, and file storage from Google."
  },
  {
    "name": "React",
    "icon": "/React.svg",
    "description": "I have a good understanding of React, which I use to build user interfaces and single-page applications. My knowledge allows me to create dynamic and efficient front-end experiences."
  },
  {
    "name": "Next.js",
    "icon": "/Next.js.svg",
    "description": "I have a basic understanding of Next.js, a React framework. I can use it to build performant and scalable web applications with server-side rendering."
  },
  {
    "name": "PostgreSQL",
    "icon": "/PostgresSQL.svg",
    "description": "I have a basic understanding of PostgreSQL, a powerful open-source relational database. I'm familiar with creating and managing databases for various applications."
  }
]